In [43]:
import pandas as pd
import numpy as np

In [44]:
# LOAD THE DATA AND RENAME THE COLUMN
# ACCOUNT CSV FILE
df = pd.read_csv("../data/accounts.csv")
df.rename(columns={'id': 'account_id'}, inplace=True)
df.rename(columns={'date': 'open_date'}, inplace=True)

In [45]:
# REMOVE SPACES FROM COLUMN NAMES
df.rename(columns=lambda x: x.strip(), inplace=True)

# COUNT THE NUMBER OF MISSING VALUES IN EACH COLUMN; none
missing_values_num = df.isna().sum()
print(missing_values_num)

account_id             0
district_id            0
open_date              0
statement_frequency    0
dtype: int64

In [46]:
# TYPE CAST THE DATE COLUMN
df['open_date'] = pd.to_datetime(df['open_date'])

/var/folders/1z/6nvrnkz13ms1y39fh2328y7m0000gn/T/ipykernel_20072/2923481415.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['open_date'] = pd.to_datetime(df['open_date'])

In [47]:
# LOAD DISTRCICT DATA AND GET THE DISTRICT NAME
district_df = pd.read_csv("./districts_py.csv")

df = pd.merge(df, district_df, on='district_id', how ='left')
df['district_id'] = df['name']

# for i in df.index:
#     for j in district_df.index: # convert it to python function
#         if (df['district_id'][i] == district_df['id'][j]):
#             df['district_id'][i] = district_df['name'][j]

In [48]:
# CHANGE THE COLUMN NAME AND DROP THE COLUMNS
df.rename(columns={'district_id': 'district_name'}, inplace=True)
df = df.iloc[:, :4]

In [49]:
df

      account_id  district_name  open_date statement_frequency
0              1          Pisek 1995-03-24             monthly
1              2    Hl.m. Praha 1993-02-26             monthly
2              3          Kolin 1997-07-07             monthly
3              4        Pribram 1996-02-21             monthly
4              5  Cesky Krumlov 1997-05-30             monthly
...          ...            ...        ...                 ...
4495       11027     Ceska Lipa 1996-07-26              weekly
4496       11054       Kromeriz 1996-02-01              weekly
4497       11138        Karvina 1995-08-18              weekly
4498       11141    Hl.m. Praha 1997-02-11              weekly
4499       11349    Hl.m. Praha 1995-05-26              weekly

[4500 rows x 4 columns]

In [51]:
# LOAD THE LINKS DATA FOR NUM_CUSTOMERS COLUMN
link_df = pd.read_csv("../data/links.csv")
df['num_customers'] = link_df.groupby('account_id')['account_id'].count()
df

      account_id  district_name  open_date statement_frequency  num_customers
0              1          Pisek 1995-03-24             monthly            NaN
1              2    Hl.m. Praha 1993-02-26             monthly            1.0
2              3          Kolin 1997-07-07             monthly            2.0
3              4        Pribram 1996-02-21             monthly            2.0
4              5  Cesky Krumlov 1997-05-30             monthly            1.0
...          ...            ...        ...                 ...            ...
4495       11027     Ceska Lipa 1996-07-26              weekly            NaN
4496       11054       Kromeriz 1996-02-01              weekly            NaN
4497       11138        Karvina 1995-08-18              weekly            NaN
4498       11141    Hl.m. Praha 1997-02-11              weekly            NaN
4499       11349    Hl.m. Praha 1995-05-26              weekly            NaN

[4500 rows x 5 columns]

In [ ]:
# CREDIT_CARDS

In [3]:
# LOAN
loan_df = pd.read_csv("./loans_py.csv")
loan_df
for i in loan_df.index: # convert: .apply(lambda x: ... )
    if loan_df['status'] == 'A' or loan_df['status'] == 'C':
        df['loan'] = 'T'
    else: # loan_df['status'] == 'B' | loan_df['status'] == 'D'
        df['loan'] = 'F'

     loan_id  account_id        date  amount  payments  terms status
0       4959           2  1994-01-05   80952      3373     24      A
1       4961          19  1996-04-29   30276      2523     12      B
2       4962          25  1997-12-08   30276      2523     12      A
3       4967          37  1998-10-14  318480      5308     60      D
4       4968          38  1998-04-19  110736      2307     48      C
..       ...         ...         ...     ...       ...    ...    ...
677     7294       11327  1998-09-27   39168      1632     24      C
678     7295       11328  1998-07-18  280440      4674     60      C
679     7304       11349  1995-10-29  419880      6998     60      C
680     7305       11359  1996-08-06   54024      4502     12      A
681     7308       11362  1996-12-27  129408      5392     24      A

[682 rows x 7 columns]

In [ ]:
# LOAN_AMOUNT
for i in loan_df.index:
    if df['account_id'] == loan_df['account_id']:
        df['loan_amount'] = loan_df['amount']
        
# LOAN PAYMENT
for i in loan_df.index:
    if df['account_id'] == loan_df['account_id']:
        df['loan_payment'] = loan_df['payments']

In [ ]:
# LOAN_TERM
if df['loan'] == 'T':
    df['loan_term'] = loan_df['terms']

# LOAN_STATUS
if df['loan'] == 'T':
    if loan_df['status'] == 'A' or loan_df['status'] == 'B':
        df['loan_status'] = 'expired'
    else: # C or D
        df['loan_status'] = 'current'

In [ ]:
# LOAN_DEFAULT:
if loan_df['status'] == 'B' or loan_df['status'] == 'D':
    df['loan_default'] = 'T'
else:
    df['loan_default'] = 'F'

In [ ]:
# MAX_WITHDRAWAL